# Дан диапазон целых чисел от N1 до N2.
# Найти факториал каждого третьего простого числа в заданном диапазоне

import math

def num(l):
    l_2 = []
    for i in l_1:
        k = 0
        for a in range(2 , i):
            if i % a == 0:
                k += 1
        if k <= 0:
            l_2.append(i)

    for f in range(2,len(l_2),3):
        print("факториал каждого третьего числа(",l_2[f],")  =  ",math.factorial(l_2[f]))


l_1 = [1000,11,23,88,76,17,98,101,100,44,19,4,44, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199]

num(l_1)